$(document).ready(function() {
    $("#sub").click(function() {
        if ($("#h7:checked").length == "") {
            alert("12. โดยรวมแล้วท่านรู้สึกว่าได้รับการพักผ่อนเพียงพอหรือไม่")
            $("#h7").focus()
            return false
        }
        if ($("#h8:checked").length == "") {
            alert(
                "13. โดยรวมแล้วใน 1 สัปดาห์ท่านทำกิจกรรมเพื่อเป็นการพักผ่อนหย่อนใจ (อ่านหนังสือ ดูหนัง ฟังเพลง ชอบปิง เล่นเกมส์ ปลูกต้นไม้ ฯลฯ) หรือไม่"
            )
            $("#h8").focus()
            return false
        }
        if ($("#h9:checked").length == "") {
            alert(
                "14. โดยรวมแล้วท่านมีความเครียด (เครียดจากการทำงาน/ เรื่องครอบครัว/ เรื่องอื่นๆ) บ้างหรือไม่"
            )
            $("#h9").focus()
            return false
        }
        if ($("#h10:checked").length == "") {
            alert(
                "15. โดยรวมแล้วท่านคิดว่าชีวิตของท่านเป็นไปตามที่ท่านคาดหวัง หรือไม่"
            )
            $("#h10").focus()
            return false
        }
        if ($("#h11:checked").length == "") {
            alert(
                "16. เมื่อประสบปัญหาในชีวิต โดยทั่วไปท่านสามารถจัดการกับปัญหาได้หรือไม่"
            )
            $("#h11").focus()
            return false
        }
        if ($("#cv2:checked").length == "") {
            alert(
                "CV2. สถานการณ์การแพร่ระบาดโควิด-19 มีผลกระทบต่อภาพรวมในมิติผ่อนคลายดี ของท่านเพียงใด"
            )
            $("#cv2").focus()
            return false
        }

        if (confirm("กรุณายืนยันการบันทึกข้อมูลนี้อีกครั้ง!")) {
            $("#sub").html("ระบบกำลังทำการบันทึกข้อมูลของท่านโปรดรอสักครู่ .....")
            return true
        } else {
            return false
        }
    })
})