$(document).ready(function(){


 $("#sub").click(function(){


    if($("#h64:checked").length == ""){
        alert("64. ท่านรู้สึกว่าโดยเฉลี่ยในหนึ่งสัปดาห์ท่านทำงานกี่วัน");
        $("#h64").focus();
        return false;
    }
    if($("#h65:checked").length == ""){
        alert("65. ท่านรู้สึกว่าโดยเฉลี่ยท่านทำงานวันละกี่ชั่วโมง");
        $("#h65").focus();
        return false;
    }
    if($("#h66:checked").length == ""){
        alert("66. ท่านรู้สึกว่า ได้พักผ่อนโดยเฉลี่ย (ไม่รวมการนอนหลับตอนกลางคืน) วันละกี่ชั่วโมง");
        $("#66").focus();
        return false;
    }
    if($("#h67:checked").length == ""){
        alert("67.หน่วยงานของท่าน มีความยืดหยุ่น ในการทำงานหรือไม่ (เช่น ความยืดหยุ่นในการทำงานนอกสถานที่ ไม่ต้องเข้างาน/ ออกงานตามเวลาที่กำหนด/ สามารถเลือกวันหยุดของตนเองได้ ฯลฯ)");
        $("#h67").focus();
        return false;
    }
    if($("#h68:checked").length == ""){
        alert("68.ท่านทำงานตรงตามวุฒิการศึกษาหรือไม่");
        $("#h68").focus();
        return false;
    }


 

    if(confirm("กรุณายืนยันการบันทึกข้อมูลนี้อีกครั้ง!")){

       $("#sub").html("ระบบกำลังทำการบันทึกข้อมูลของท่านโปรดรอสักครู่ .....");
       return true;
       

    }else{

       return false;

    }


});

});