$(document).ready(function() {
    $("#sub").click(function() {
        if ($("#h55:checked").length == "") {
            alert("60. ท่านจะแนะนำญาติ/เพื่อน/คนรู้จักมาทำงานที่องค์กรของท่านหรือไม่")
            $("#h55").focus()
            return false
        }
        if ($("#h56:checked").length == "") {
            alert(
                "61. หากมีใครกล่าวถึงองค์กรในทางที่ไม่เหมาะสม ท่านจะปกป้ององค์กรของท่านหรือไม่"
            )
            $("#h56").focus()
            return false
        }
        if ($("#h57:checked").length == "") {
            alert(
                "62. ท่านภาคภูมิใจที่ได้เป็นพนักงาน/ บุคลากรขององค์กร/ ได้ทำงานในองค์กรนี้หรือไม่"
            )
            $("#h57").focus()
            return false
        }
        if ($("#h58:checked").length == "") {
            alert(
                "63. ขณะที่ทำงานอยู่ในองค์กรนี้ หากท่านมีโอกาสได้ศึกษาต่อและเมื่อสำเร็จการศึกษาแล้ว ท่านจะทำงานต่อหรือว่าลาออก"
            )
            $("#h58").focus()
            return false
        }
        if ($("#h59:checked").length == "") {
            alert(
                "64. ถ้าท่านมีโอกาสเปลี่ยนสถานที่ทำงาน หรือองค์กรอื่นชวน/ติดต่อไปทำงาน ท่านพร้อมที่จะไป หรือไม่"
            )
            $("#h59").focus()
            return false
        }
        if ($("#h60:checked").length == "") {
            alert(
                "65. ท่านรู้สึกเป็นเจ้าของร่วมขององค์กรที่ท่านทำงานในปัจจุบัน หรือไม่"
            )
            $("#h60").focus()
            return false
        }
        if ($("#h61:checked").length == "") {
            alert("66. ท่านทุ่มเททำงานเพื่อประโยชน์ขององค์กรของท่านหรือไม่")
            $("#h61").focus()
            return false
        }
        if ($("#h62:checked").length == "") {
            alert(
                "67. ท่านเป็นคน คิดใหม่ ทำใหม่ เพื่อสร้างความก้าวหน้าให้กับองค์กรของท่านหรือไม่"
            )
            $("#h62").focus()
            return false
        }
        if ($("#h63:checked").length == "") {
            alert("68.ในแต่ละวัน ท่านทำงานอย่างมีเป้าหมาย หรือไม่")
            $("#h63").focus()
            return false
        }

        if (confirm("กรุณายืนยันการบันทึกข้อมูลนี้อีกครั้ง!")) {
            $("#sub").html("ระบบกำลังทำการบันทึกข้อมูลของท่านโปรดรอสักครู่ .....")
            return true
        } else {
            return false
        }
    })
})