$(document).ready(function(){


 $("#sub").click(function(){


    if($("#h38:checked").length == ""){
        alert("38. งานของท่าน มีความท้าทายและส่งเสริมให้ท่านได้เรียนรู้สิ่งใหม่ๆ หรือไม่");
        $("#h38").focus();
        return false;
    }
    if($("#h39:checked").length == ""){
        alert("39. งานของท่าน มีความชัดเจนของโอกาสในการเติบโตในตำแหน่ง หน้าที่หรือไม่");
        $("#h39").focus();
        return false;
    }
    if($("#h40:checked").length == ""){
        alert("40. งานของท่านในขณะนี้มีความมั่นคง หรือไม่");
        $("#h40").focus();
        return false;
    }
    if($("#h41:checked").length == ""){
        alert("41. ในการทำงาน ท่านสามารถแสดงความคิดเห็นและมีส่วนร่วมในข้อเสนอแนะกับนายจ้าง หรือหัวหน้างาน หรือไม่");
        $("#h41").focus();
        return false;
    }
    if($("#h42:checked").length == ""){
        alert("42. ท่านได้รับ การปฏิบัติอย่างถูกต้องตามกฎหมายแรงงาน/ พ.ร.บ.ข้าราชการ 2551/ พรบ.แรงงานรัฐวิสาหกิจสัมพันธ์ 2547/ กฎหมายอื่นๆ จากองค์กรของท่าน หรือไม่");
        $("#h42").focus();
        return false;
    }
    if($("#h43:checked").length == ""){
        alert("43. ท่านได้รับการพิจารณาเลื่อนขั้น/ เลื่อนตำแหน่ง/ ปรับขึ้นเงินค่าจ้างประจำปีที่ผ่านมาด้วยความเหมาะสมหรือไม่");
        $("#h43").focus();
        return false;
    }
    if($("#h44:checked").length == ""){
        alert("44. ความถูกต้อง ของการจ่ายค่าจ้าง ค่าล่วงเวลา ฯลฯ ที่ท่านได้รับจากองค์กรของท่านเป็นอย่างไร");
        $("#h44").focus();
        return false;
    }
    if($("#h45:checked").length == ""){
        alert("45. ความตรงเวลา ของการจ่ายค่าจ้าง ค่าล่วงเวลา ฯลฯ ที่ท่านได้รับจากองค์กรของท่านเป็นอย่างไร");
        $("#h45").focus();
        return false;
    }
    if($("#h46:checked").length == ""){
        alert("46. ค่าตอบแทนที่ท่านได้รับคุ้มค่ากับความเสี่ยงที่อาจเกิดจากการทำงาน (การถูกฟ้องร้อง/ การได้รับอันตรายจากการทำงาน ฯลฯ)");
        $("#h46").focus();
        return false;
    }
    if($("#h47:checked").length == ""){
        alert("47. ท่านได้รับการดูแลเกี่ยวกับสุขภาพที่ดีจากองค์กร หรือไม่");
        $("#h47").focus();
        return false;
    }
    if($("#h48:checked").length == ""){
        alert("48. ท่านพึงพอใจต่อสภาพแวดล้อมโดยรวมขององค์กร หรือไม่");
        $("#h48").focus();
        return false;
    }
    if($("#h49:checked").length == ""){
        alert("49. ท่านพึงพอใจกับสวัสดิการที่องค์กรจัดให้หรือไม่");
        $("#h49").focus();
        return false;
    }
    if($("#h50:checked").length == ""){
        alert("50.โดยรวมแล้วที่ทำงานของท่านให้ความสำคัญกับการทำงานเป็นทีมหรือไม่");
        $("#h50").focus();
        return false;
    }
    if($("#h51:checked").length == ""){
        alert("51. โดยรวมแล้วความสัมพันธ์ในที่ทำงานของท่านเหมือนพี่เหมือนน้อง หรือไม่");
        $("#h51").focus();
        return false;
    }if($("#h52:checked").length == ""){
        alert("52. โดยรวมแล้วท่านสื่อสารพูดคุยกับเพื่อนร่วมงานในที่ทำงานหรือไม่");
        $("#h52").focus();
        return false;
    }if($("#h53:checked").length == ""){
        alert("53. โดยรวมแล้วในที่ทำงานของท่านมีการถ่ายทอดแลกเปลี่ยนแบบอย่างการทำงานระหว่างกันหรือไม่");
        $("#h53").focus();
        return false;
    }
    if($("#h54:checked").length == ""){
        alert("54. โดยรวมแล้วท่านทำงานอย่างมี 'ความสุข' หรือไม่");
        $("#h54").focus();
        return false;
    }

 

    if(confirm("กรุณายืนยันการบันทึกข้อมูลนี้อีกครั้ง!")){

       $("#sub").html("ระบบกำลังทำการบันทึกข้อมูลของท่านโปรดรอสักครู่ .....");
       return true;
       

    }else{

       return false;

    }


});

});