$(document).ready(function(){


 $("#sub").click(function(){


    if($("#h31:checked").length == ""){
        alert("31. โดยรวมแล้วท่านสนใจในการแสวงหาความรู้ใหม่ๆ เพิ่มเติมจากแหล่งความรู้ต่างๆ หรือไม่");
        $("#h31").focus();
        return false;
    }
    if($("#h32:checked").length == ""){
        alert("32. โดยรวมแล้ว ท่านสนใจที่จะพัฒนาตนเอง เพื่อความก้าวหน้าในชีวิตหรือไม่");
        $("#h32").focus();
        return false;
    }
    if($("#h33:checked").length == ""){
        alert("33. ท่านมีโอกาสที่จะได้รับการอบรม/ ศึกษาต่อ/ ดูงาน เพื่อพัฒนาทักษะและความสามารถของตนเองหรือไม่");
        $("#h33").focus();
        return false;
    }

 

    if(confirm("กรุณายืนยันการบันทึกข้อมูลนี้อีกครั้ง!")){

       $("#sub").html("ระบบกำลังทำการบันทึกข้อมูลของท่านโปรดรอสักครู่ .....");
       return true;
       

    }else{

       return false;

    }


});

});