$(document).ready(function() {
    $("#sub").click(function() {
        if ($("#h12:checked").length == "") {
            alert("17. โดยรวมแล้ว ท่านรู้สึกเอื้ออาทร/ ห่วงใยต่อคนรอบข้างหรือไม่")
            $("#h12").focus()
            return false
        }
        if ($("#h13:checked").length == "") {
            alert("18. โดยรวมแล้ว ท่านให้การช่วยเหลือแก่คนรอบข้างหรือไม่")
            $("#h13").focus()
            return false
        }
        if ($("#h14:checked").length == "") {
            alert(
                "19. โดยรวมแล้วท่านเต็มใจและยินดี ในการทำประโยชน์เพื่อส่วนรวม หรือไม่"
            )
            $("#h14").focus()
            return false
        }
        if ($("#h15:checked").length == "") {
            alert(
                "20. โดยรวมแล้วท่านเข้าร่วมกิจกรรมที่เป็นประโยชน์ต่อสังคม เช่น การปลูกป่า การบริจาคสิ่งของ หรือไม่"
            )
            $("#h15").focus()
            return false
        }
        if ($("#h16:checked").length == "") {
            alert(
                "21. โดยรวมแล้วท่านได้ทำกิจกรรมที่สามารถทำได้ด้วยตนเองและมีประโยชน์ต่อสังคม เช่น การคัดแยกขยะ การลดใช้ถุงพลาสติก เป็นต้น"
            )
            $("#h16").focus()
            return false
        }
        if ($("#cv3:checked").length == "") {
            alert(
                "CV3. สถานการณ์การแพร่ระบาดโควิด-19 มีผลกระทบต่อภาพรวมในมิติน้ำใจดี ของท่านเพียงใด"
            )
            $("#cv3").focus()
            return false
        }

        if (confirm("กรุณายืนยันการบันทึกข้อมูลนี้อีกครั้ง!")) {
            $("#sub").html("ระบบกำลังทำการบันทึกข้อมูลของท่านโปรดรอสักครู่ .....")
            return true
        } else {
            return false
        }
    })
})