$(document).ready(function() {
    $("#1_1").change(function() {
        if (isNaN($("#1_1").val())) {
            alert("1.1 ปัจจุบัน ท่านมีน้ำหนัก * ใส่เฉพาะตัวเลขทั่วนั้น *")
            $("#1_1").focus()
            return false
        }
    })
    $("#1_2").change(function() {
        if (isNaN($("#1_2").val())) {
            alert("1.2 ส่วนสูง * ใส่เฉพาะตัวเลขทั่วนั้น *")
            $("#1_2").focus()
            return false
        }
    })
    $("#1_3").change(function() {
        if (isNaN($("#1_3").val())) {
            alert("1.3 เส้นรอบเอว * ใส่เฉพาะตัวเลขทั่วนั้น *")
            $("#1_3").focus()
            return false
        }
    })

    /* Check */

    $("#sub").click(function() {
        if ($("#1_1").val().length == "" || $("#1_1").val() == 0) {
            alert("1.1 ปัจจุบัน ท่านมีน้ำหนัก * ใส่เฉพาะตัวเลขทั่วนั้น *")
            $("#1_1").focus()
            return false
        }
        if ($("#1_2").val().length == "") {
            alert("1.2 ส่วนสูง * ใส่เฉพาะตัวเลขทั่วนั้น *")
            $("#1_2").focus()
            return false
        }
        if ($("#1_3").val().length == "") {
            alert("1.3 เส้นรอบเอว * ใส่เฉพาะตัวเลขทั่วนั้น *")
            $("#1_3").focus()
            return false
        }

        if ($("#h2:checked").length == "") {
            alert("2. โดยปกติท่านกินอาหารเช้า โดยเฉลี่ยสัปดาห์ละกี่วัน")
            $("#h2").focus()
            return false
        }

        if ($("#hn3:checked").length == "") {
            alert(
                "3. โดยปกติท่านกินอาหารที่มีรสหวานจัด เช่น ลูกอม/ทอฟฟี่ ช็อคโกแลต ขนมหวานต่าง ๆ เครื่องดื่มที่มีรสหวาน น้ำอัดลมฯลฯ บ่อยเพียงใด"
            )
            $("#hn3").focus()
            return false
        }
        if ($("#hn4:checked").length == "") {
            alert(
                "4. โดยปกติท่านกินอาหารที่มีรสเค็มจัด เช่น อาหารที่เพิ่มน้ำปลา หรือซอสปรุงรสต่างๆ อาหารกระป๋อง ขนมขบเคี้ยว อาหารกึ่งสำเร็จรูป อาหารตากแห้งหมักดอง อาหารรสจัด บ่อยเพียงใด"
            )
            $("#hn4").focus()
            return false
        }
        if ($("#hn5:checked").length == "") {
            alert(
                "5. โดยปกติท่านกินอาหารมันจัด/ ของมันจัด เช่น ของทอด หมูกระทะ อาหารที่มีส่วนผสมของซีส/ เนย ฟาสต์ฟู้ดฯ บ่อยเพียงใด"
            )
            $("#hn5").focus()
            return false
        }
        if ($("#hn6:checked").length == "") {
            alert("6. โดยปกติท่านกินผักและผลไม้ บ่อยเพียงใด")
            $("#hn6").focus()
            return false
        }
        if ($("#hn7:checked").length == "") {
            alert(
                "7. ปัจจุบันท่านเห็นด้วยกับประโยคนี้หรือไม“การบริโภค กัญชา เป็นเรื่องที่ยอมรับได้”"
            )
            $("#hn7").focus()
            return false
        }

        if ($("#h3:checked").length == "") {
            alert("8. ปัจจุบันท่านออกกำลังกายโดยเฉลี่ยสัปดาห์ละกี่วัน")
            $("#h3").focus()
            return false
        }
        if ($("#h4:checked").length == "") {
            alert("9. ปัจจุบันท่านสูบบุหรี่/ ใบจาก/ ยาเส้น หรือไม่")
            $("#h4").focus()
            return false
        }
        if ($("#h5:checked").length == "") {
            alert(
                "10. ปัจจุบันท่านดื่มเครื่องดื่มที่มีแอลกอฮอลเช่น เหล้า เบียร์ ไวน์ สาโท หรือสุราพื้นบ้านหรือไม่"
            )
            $("#h5").focus()
            return false
        }
        if ($("#h6:checked").length == "") {
            alert("11. โดยรวมแล้วท่านพึงพอใจกับสุขภาพกายของท่านหรือไม่")
            $("#h6").focus()
            return false
        }
        if ($("#cv1:checked").length == "") {
            alert(
                "CV1. สถานการณ์การแพร่ระบาดโควิด-19 มีผลกระทบต่อภาพรวมในมิติสุขภาพกายดี ของท่านเพียงใด"
            )
            $("#cv1").focus()
            return false
        }

        if (confirm("กรุณายืนยันการบันทึกข้อมูลนี้อีกครั้ง!")) {
            $("#sub").html("ระบบกำลังทำการบันทึกข้อมูลของท่านโปรดรอสักครู่ .....")
            return true
        } else {
            return false
        }
    })
})