$(document).ready(function() {
    $("#sub").click(function() {
        if ($("#h34:checked").length == "") {
            alert(
                "39. ท่านรู้สึกว่า การผ่อนชำระหนี้สินต่างๆ โดยรวมของท่านในปัจจุบันเป็นภาระ หรือไม่"
            )
            $("#h34").focus()
            return false
        }
        if ($("#h35:checked").length == "") {
            alert("40. ท่านผ่อนชำระหนี้ ตามกำหนดเวลาทุกครั้ง หรือไม่")
            $("#h35").focus()
            return false
        }
        if ($("#h36:checked").length == "") {
            alert("41. โดยรวมแล้ว ท่านมีเงินเก็บออมในแต่ละเดือนหรือไม่")
            $("#h36").focus()
            return false
        }
        if ($("#h37:checked").length == "") {
            alert(
                "42. โดยรวมแล้ว ค่าตอบแทนที่ท่านได้รับทั้งหมดในแต่ละเดือนเป็นอย่างไร เมื่อเปรียบเทียบกับรายจ่ายทั้งหมดในแต่ละเดือน"
            )
            $("#h37").focus()
            return false
        }

        if ($("#cv8:checked").length == "") {
            alert(
                "CV8. สถานการณ์การแพร่ระบาดโควิด-19 มีผลกระทบต่อภาพรวมในมิติสุขภาพเงินดี ของท่านเพียงใด"
            )
            $("#cv8").focus()
            return false
        }

        if (confirm("กรุณายืนยันการบันทึกข้อมูลนี้อีกครั้ง!")) {
            $("#sub").html("ระบบกำลังทำการบันทึกข้อมูลของท่านโปรดรอสักครู่ .....")
            return true
        } else {
            return false
        }
    })
})